{
    "title":"The Site Redesign in Epsilon",
    "subtitle":"The Visual Refresh in Epsilon",
    "body":"The look of the site has been completely redesigned. It has changed from...<br><img src='/media/screenshot/history/deltaDesktop.png' width='100%'>to...<br><img src='/media/screenshot/history/epsilonDesktop.png' width='100%'>A lot of things have changed in this update. The newsfeeds, the cards, the grid, the toolbar, the colours, and much more.<h2>The Toolbar</h2>The toolbar has been completely redesigned. The toolbar in the Delta update had two rows: The page title with a more button, and a row with tabs. It was coloured with your theme colour, and had white text and icons. Now, in Epsilon, it is just one row, with text saying \"Home\", \"Code\", and \"Media\". The background colour is white or dark grey, depending on the theme. It blends in with the background of the page, until you scroll, when a shadow appears. It is only one row. Because it matches with the background, and is much smaller, it changes the balance of the page. There is much less weight on the toolbar.<h2>Title</h2>Heading down the page, the next thing is the title. In delta, it is using material typography and the roboto font. Now, in Epsilon, it's using the Roboto Mono font.<h2>Newsfeed</h2>The newsfeeds in Delta were messy. There were three of them on the homescreen, News, Code, and Media. On top of that, it was different than the news page. It was also limited to just three stories per category, to conserve space, because it scrolled vertically. In the Epsilon Update, there is now only one newsfeed, latest. Instead of scrolling vertically and being limited to three, there is currently all of the stories displayed (this will change in the future, it will be given a dedicated page.), because it scrolls horizontally. This works great on all platforms, and makes it much less cluttered.<h2>The Cards</h2>In the Delta update, there was a fixed number of columns, depending on the device. On computers, there were three, on tablets, there were two, and on phones, there was one. Now, using some features from CSS Grid, there as many columns of at least 320px that are as wide as possible. That means that instead of having three columns on PC, you'll have somewhere in between four and six. On a phone, you won't be able to see a difference, because you still have one column, and on tablets, you have two or three. The cards are much more consistent in terms of width, and there are as many columns as appropriate for the device.<h2>Navigation Drawer</h2>There is now a floating action button in the bottom right, that is clickable. When you press it, a navigation drawer appears. Here, there's a link to Home, Code, and Media, as well as an options button at the bottom."
}