{
    "title":"The Epsilon Update",
    "subtitle":"Internal and External Redesign",
    "body":"The last major site redesign was in the Gamma update, version 2.0. The delta update, version 3.0, was a massive internal change, but didn't change much of the design. Along with that, every version had remenants of version 0.1 in it, because the site had never been reconstructed. To improve speed by reducing the amount of old styling and javascript, as well introduce many new features, including responsive CSS Grid, a new design overhaul with Material Design Components, five all-new programming experiments on the new code page, and much, much more.<br><br><h2>The New Design</h2><br><h2>The Basics</h2>Here's the new site design:<img src='/media/screenshot/history/epsilonDesktop.png' width='100%'><br>This site design simplifies the site. The toolbar is no longer a two-ligned tabbed coloured bar, but three simple words: Home, Code, and Media. That's it. Below that, we have the page name in big text. And below that, we have the latest form the site, not in three columns, but in a scrollable row. And finally, below that, we have cards in a simple column. It's simple, visually appealing, and easy to use.<br><br><h2>CSS Grid</h2><br>Version 3.2 added CSS grid to the site. However, the goal of that implementation was to simplify the DOM and the code, while keeping the results the same. IN this version, however, CSS Grid is used width the auto-fit mechanic, meaning there are as many columns of 320px as possible, and those columns are as wide as possible. Instead of 1, 2, or 3 columns depending on your screen size, the cards are all roughly a predicable size: ~320px.<br><br><h2>Material Design Components</h2><br>Again, this isn't new. Material Design Components have been heavily used in the site, with the toolbar and the cards. However, this version has been built from the ground up using Material Components, which means that it supports JavaScript for these elements, such as the dialogs or drawers, and the site can make better use of them. This version of the site uses a simple waterfall toolbar, cards, a dialog (currently only used for a new user message), a drawer for navigation, and a floating action button for opening the drawer. These components make the design more user-friendly and more visually appealing.<br><br><h2>The new Code Page</h2><br>One of the biggest new features in this version is the replacement of the old JavaScript and HTML5 pages with a new code page. This new page also replaces all of the pointless tests on those pages, and replaces them with five usable and interesting tests.<br><ul><li>A Working Text Editor</li><li>A Voxel Model Rendered in WebVR</li><li>Pure JS keyboard controls for a potential game</li><li>An extremely basic Hello, World app in WebAssembly</li><li>and animated transitions in CSS Animations, using DOM generated in JavaScript on the fly.</li></ul><br>These new tests are much more interesting than the \"Tests\" of an alert button. Those were good for learning, but not very interesting for someone visiting the site. Now, we have a working text editor, that uses localStorage to keep track of documents, and an export function for downloading to your computer. There's a WebVR test, using a 3d voxel model, and AFrame. There's a keyboard controls in JS using Event Listeners, there's my first test in WebAssembly, written in C and compiled using Emscripten, and there's a CSS Animations page transitions test, that uses JavaScript to generate new DOM, and then uses CSS animations to animate it.<br><br><h2>The New News Reader</h2><br>Another Remade feature in the Epsilon Update is the news reader. It uses a material component dialog that is also used for many other features, such as the options popup, "
}